## Introduction
The first step in most data analytics projects is reading the data file. In this exercise, you'll create Series and DataFrame objects, both by hand and by reading data files.

## Exercises

### 1.
In the cell below, create a DataFrame fruits

In [7]:
import pandas as pd

fruits = pd.DataFrame({'Apples' : [30], 'Bananas' :[21]})
fruits

   Apples  Bananas
0      30       21

### 2.
Create a dataframe fruits_sales:

In [14]:
fruit_sales = pd.DataFrame({'Apples':[35,41], 'Bananas': [21,34]}, index = ['2017 Sales', '2018 Sales'])
fruit_sales

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34

### 3.

Create a variable `ingredients` with a Series that looks like:

```
Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
Name: Dinner, dtype: object
```

In [17]:
ingredients = pd.Series(['4 cups','1 cup', '2 large', '1 can'], index=['Flour', 'Milk', 'Eggs', 'Spam'], name= 'Dinner')
ingredients

Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
Name: Dinner, dtype: object

### 4.
Read the csv dataset into DataFrame using this link: `https://raw.githubusercontent.com/ahm90-dev/pandas_activity/refs/heads/main/csv/annual-enterprise-survey-2023-financial-year-provisional.csv`

In [28]:
url = "https://raw.githubusercontent.com/ahm90-dev/pandas_activity/refs/heads/main/csv/annual-enterprise-survey-2023-financial-year-provisional.csv"
review = pd.read_csv(url)
review.head() # Display first 5 rows

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2023,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,930995,ANZSIC06 divisions A-S (excluding classes K633...
1,2023,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,821630,ANZSIC06 divisions A-S (excluding classes K633...
2,2023,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,84354,ANZSIC06 divisions A-S (excluding classes K633...
3,2023,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,25010,ANZSIC06 divisions A-S (excluding classes K633...
4,2023,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,832964,ANZSIC06 divisions A-S (excluding classes K633...

### 5.

Run the cell below to create and display a DataFrame called `animals`:

In [32]:
animals = pd.DataFrame({'Cows': [12, 20], 'Goats': [22, 19]}, index=['Year 1', 'Year 2'])
animals

        Cows  Goats
Year 1    12     22
Year 2    20     19

In the cell below, write code to save this DataFrame to disk as a csv file with the name `cows_and_goats.csv`.

In [38]:
# saving a file to csv

animals.to_csv('cows_and_goats.csv')
print("File saved successfully")

File saved successfully